# Вы можете расположить сценарий своей игры в этом файле.

# Определение персонажей игры.
define a = Character('Артём', color="#c8ffc8")

# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:

    scene back1

    "8:30. Первые мысли после пробуждения сразу врезаются в голову с неистовой скоростью. Пара секунд и приходит осознание, что начался ещё один день. Снова."

    "*звон будильника*"

    show artem

    a "Чёрт! Не стоило мне так долго играть этой ночью. Как бы я быстро не собирался все равно опоздаю. Сил нет снова выслушивать упреки в мою сторону. Думаю, у меня отличный повод никуда сегодня не пойти."

    a "Все равно этот день ничем не будет отличаться от предыдущих. Ничего нового. Скука."

    hide artem

    "Посмотрев по сторонам, я увидел в углу пыльную гитару, которая как будто плачет  от того, что ей никто не хочет пользоваться. На шкафу лежит волейбольный мяч, там же расположены недочитанные мной книги, а около жужжащего компьютера аккуратно стоят нетронутые холсты и запечатанные кисти."

    "Я сгреб все лишнее со стола в небольшую кучу, освободив место для рук, и, как обычно, первым делом открыл ютуб.  Процесс пробуждения почти подходил к концу, мой живот издал резкий урчащий звук. "

    show artem
    with dissolve

    a "Пора бы и перекусить."

    hide artem
    with dissolve

    'Я прошел по коридору сначала в ванную, а после на кухню, где обнаружил записку на столе, написанную почерком мамы: "Доброе утро, еда в холодильнике. Удачной учебы <3". Будет грустно видеть ее лицо после звонка из школы. Закончив прием пищи, я отправился обратно к себе.'

    "Осенний ветер колышет ветки за окном, листья, медленно кружась, падают на подоконник, а лучи солнца изо всех сил стараются проникнуть через тонкие шторы в эту невеселую комнату. Это заворожило меня, я даже подумал, что еще могу улавливать что то прекрасное в таких мелочах."

    show artem
    with dissolve

    "Будь я музыкантом или художником,именно сейчас меня должно было посетить вдохновение для создания чего-то великого. Однако я не Вивальди и не Левитан. Я могу лишь просто наслаждаться этой красотой, чтобы хоть как-то скрасить серость обыденных дней."

    hide artem
    with dissolve

    "Доделав остаток утренних процедур, я, как обычно, не знал чем заняться дальше. В любой другой день я бы просто открыл стим и запустил одну из игр, просидевших в ней до ночи. Но в этот раз даже играть не хотелось. Я завязал волосы в хвост и лег на уже заправленную постель. Никогда не любил так делать, ведь ты остаешься наедине со своими мыслями. Один на один."

    "Я даже не помню когда именно это началось. Год назад? Два? Когда я потерял всяческий интерес ко всему, что я делаю? И ведь пробовал снова найти то, что будет затягивать с головой, и не раз. Сейчас уже поздно искать себя, попробовать что-то новое, бросать, а затем браться за другое. Одиннадцатый класс, экзамены, выбор вуза. Почему я не ушел после девятого... "

    ' Я не хочу прожить жизнь так ничего и не сделав, пока я только потребляю, то что создали другие. Бесит. Мне нужно нечто большее от жизни, но как найти это "большее"? Я всегда терял искру интереса в том, чем увлекался. Это какой-то барьер, который я не могу преодолеть в силу недостатка мотивации или чего-то еще...'

    show artem
    with dissolve

    a "Мне определенно нужен какой то толчок."

    hide artem
    with dissolve

    "Я встал с кровати, сел за компьютер и включил рандомную шугейз-группу. Было здорово, когда мы собирались с друзьями и играли что-то подобное. Помню как вчера: приносил заготовки к песне, парни ее разучивали, и мы с наслаждением играли, чувствуя каждую нотку и качаясь в ритм барабанов. Сейчас мы не поддерживаем общение: один переехал, другой бросил музыку ради учебы. Остался только Саня, с которым мы иногда играем что-то на гитарах, но это уже совсем не то, что было раньше."

    "Я до сих пор иногда пишу мелодии, правда уже на синтезаторе. Однако, то что я делаю не звучит как серьезная музыка, которую играют в филармониях. На хит городских дискотек тоже не тянет. Мои наработки похожи на легкие саундтреки к игре, однако, меня это ни капли не расстраивает."

    "Мысли в голове путаются, руки и ноги тяжелеют, в глазах начинает темнеть, кажется я совсем сегодня не выспался."

    "ОН УСНУЛ"
    return
