define a = Character('Артём', color="#c8ffc8")
define n = Character('Никита', color="#ffff00")
define asy = Character('Ася', color="#42aaff")
define p = Character('Полина', color="#8b00ff")
define v = Character('Витя', color="#ffa500")

default is_stay_home = True
default write_today = True
default is_retort = True
default is_no_matter = True

label start:

    scene

    "8:30. Первые мысли после пробуждения сразу врезаются в голову с неистовой скоростью. Пара секунд и приходит осознание, что начался ещё один день. Снова."
    "*звон будильника*"

    show artem at left with dissolve:
        xalign 0.1

    a "Чёрт! Не стоило мне так долго играть этой ночью. Как бы я быстро не собирался все равно опоздаю. Сил нет снова выслушивать упреки в мою сторону. Думаю, у меня отличный повод никуда сегодня не пойти."
    a "Все равно этот день ничем не будет отличаться от предыдущих. Ничего нового. Скука."
    hide artem

    "Посмотрев по сторонам, я увидел в углу пыльную гитару, которая как будто плачет  от того, что ей никто не хочет пользоваться."
    "На шкафу лежит волейбольный мяч, там же расположены недочитанные мной книги, а около жужжащего компьютера аккуратно стоят нетронутые холсты и запечатанные кисти."

    "Я сгреб все лишнее со стола в небольшую кучу, освободив место для рук, и, как обычно, первым делом открыл ютуб.  Процесс пробуждения почти подходил к концу, мой живот издал резкий урчащий звук. "

    show artem at left with dissolve:
        xalign 0.1
    a "Пора бы и перекусить."
    hide artem with dissolve

    'Я прошел по коридору сначала в ванную, а после на кухню, где обнаружил записку на столе, написанную почерком мамы: "Доброе утро, еда в холодильнике. Удачной учебы <3".'
    "Будет грустно видеть ее лицо после звонка из школы. Закончив прием пищи, я отправился обратно к себе."

    "Осенний ветер колышет ветки за окном, листья, медленно кружась, падают на подоконник, а лучи солнца изо всех сил стараются проникнуть через тонкие шторы в эту невеселую комнату."
    "Это заворожило меня, я даже подумал, что еще могу улавливать что то прекрасное в таких мелочах."

    show artem at left with dissolve:
        xalign 0.1
    a "Будь я музыкантом или художником,именно сейчас меня должно было посетить вдохновение для создания чего-то великого. Однако я не Вивальди и не Левитан."
    "Я могу лишь просто наслаждаться этой красотой, чтобы хоть как-то скрасить серость обыденных дней."

    hide artem with dissolve

    "Доделав остаток утренних процедур, я, как обычно, не знал чем заняться дальше. В любой другой день я бы просто открыл стим и запустил одну из игр, просидевших в ней до ночи. Но в этот раз даже играть не хотелось."
    "Я завязал волосы в хвост и лег на уже заправленную постель. Никогда не любил так делать, ведь ты остаешься наедине со своими мыслями. Один на один."

    "Я даже не помню когда именно это началось. Год назад? Два? Когда я потерял всяческий интерес ко всему, что я делаю? И ведь пробовал снова найти то, что будет затягивать с головой, и не раз."
    "Сейчас уже поздно искать себя, попробовать что-то новое, бросать, а затем браться за другое. Одиннадцатый класс, экзамены, выбор вуза. Почему я не ушел после девятого... "

    'Я не хочу прожить жизнь так ничего и не сделав, пока я только потребляю, то что создали другие. Бесит. Мне нужно нечто большее от жизни, но как найти это "большее"?'
    "Я всегда терял искру интереса в том, чем увлекался. Это какой-то барьер, который я не могу преодолеть в силу недостатка мотивации или чего-то еще..."

    show artem at left with dissolve:
        xalign 0.1

    a "Мне определенно нужен какой то толчок."

    hide artem with dissolve

    "Я встал с кровати, сел за компьютер и включил рандомную шугейз-группу. Было здорово, когда мы собирались с друзьями и играли что-то подобное."
    "Помню как вчера: приносил заготовки к песне, парни ее разучивали, и мы с наслаждением играли, чувствуя каждую нотку и качаясь в ритм барабанов."
    "Сейчас мы не поддерживаем общение: один переехал, другой бросил музыку ради учебы. Остался только Саня, с которым мы иногда играем что-то на гитарах, но это уже совсем не то, что было раньше."

    "Я до сих пор иногда пишу мелодии, правда уже на синтезаторе. Однако, то что я делаю не звучит как серьезная музыка, которую играют в филармониях. На хит городских дискотек тоже не тянет."
    "Мои наработки похожи на легкие саундтреки к игре, однако, меня это ни капли не расстраивает."

    "Мысли в голове путаются, руки и ноги тяжелеют, в глазах начинает темнеть, кажется я совсем сегодня не выспался."
    scene thinking_in_room
    "Проснувшись в полной темноте, я еще долго не решался взглянуть на время. Просто тупил в пустоту, не имея ни одной мысли в голове. Просидев так минут десять, я включил монитор. 23:11."
    "Мать видимо решила, что я устал после учебы и не стала беспокоить. Оно и к лучшему."
    "Открыв личные сообщения, я увидел, что мне написал Никита, хотя лучше сказать настрочил. Сколько помню нашу дружбу, он всегда был непоседлив и нетерпелив. Моя полная противоположность. Наверное, от этого мы так и сдружились с ним. "
    "В сообщениях он рассказал о том, что было в школе, скинул домашку и конспекты, а также отправил ссылку на какую-то статью, с подписью: “ты обязательно должен прочитать это”."
    "Планов у меня на сегодняшние ночные посиделки не было, поэтому отписавшись Никите, я пошел смотреть, что же такого он мне кинул."
    show artem at left
    a "Так и знал!"
    hide artem
    "Никита был очень вовлечен в эту сферу и постоянно скидывал мне интересные и не очень статьи об этом, но никогда не прикреплял такие подписи к этим ссылкам."
    "Скорее просто делился тем, чем увлекается, как и положено хорошим друзьям. Это была статья про геймдев, а конкретно про какую-то маленькую инди-студию, которая в этом году всех удивила своими проектами."
    "В одну из тех игр мне удалось поиграть и самому. Не сказать, что она была шедевром, но учитывая их бюджет и количество людей, вышло и правда хорошо. "
    "Прочитав все от начала и до конца, даже я был немного вдохновлен. Не представляю, что сейчас чувствовал впечатлительный Никита. Отписавшись, о том, что я прочитал все, мне сразу поступает звонок в дискорде."
    "Это был кудрявый. Только приняв его, на меня свалился невероятный словесный понос, я с трудом разбирал слова, которые выстреливал из себя этот идиот."

    show artem at left with dissolve:
        xalign 0.1
    show nikita at right with dissolve:
        zoom 0.85
        xalign 0.9

    a "Так, эминем еврейских кровей, ты можешь немного помедленнее?"
    n "НЕТ"
    a "Успокоишься, позвонишь"
    n "Пойдем прогуляемся?"
    hide nikita
    with dissolve

    menu:
        a "Я уже давно никуда не выходил, и это не казалось такой плохой идеей, однако моя лень и нежелание, что-либо делать магическим образом никуда не исчезали."
        "Остаться дома":
            jump sit_at_home
        "Выйти на улицу":
            jump go_outside

    label sit_at_home:
        "Мои отрицательные стороны и качества оказались сильнее, ничего нового."
        show nikita at right with dissolve:
            zoom 0.85
            xalign 0.9
        a "Давай не сегодня, дружище, в школе расскажешь, то что хочешь"
        n "Ты как всегда"
        a "Добрых снов"
        n "Спокойной ночи"
        hide nikita with dissolve
        hide artem with dissolve

        "Я не знаю, что на меня опять нашло. Он же мой друг и явно хотел поделиться чем-то ценным для него. Как будто я отстраняюсь от людей, потому что завидую их стремлениям и желаниям"
        "А может это и к лучшему, хотя-бы меньше поводов для беспокойства и самокопаний. С такими мыслями. Просидев до 4 ночи, меня окончательно начало клонить в сон."
        show artem at left with dissolve:
            xalign 0.1

        a "Ну хоть режим на место встанет"
        hide artem with dissolve
        "И вот я уже окончательно погрузился в свой трехчасовой отдых перед учебой."
        jump cont1

    label go_outside:
        $is_stay_home = False
        "Мне явно нужно немного подышать свежим воздухом."
        show nikita at right with dissolve:
            zoom 0.85
            xalign 0.9
        a "На площадке в 0:20, не опаздывай. Убью"
        n "Уже одеваюсь!"
        hide nikita with dissolve
        hide artem with dissolve
        "Прокравшись на цыпочках до прихожей, я накинул куртку и выбежал во двор. "
        scene city
        show artem at left with dissolve:
            xalign 0.1
        a "Все-таки, хорошо, что мы живем в домах напротив"
        "На качели уже стоял Никита с улыбкой на все лицо. Я не мог не улыбнуться в ответ. Существует только один человек, который улыбается также ярко и во все зубы как он…"
        show nikita at right with dissolve:
            zoom 0.85
            xalign 0.9
        n "Ты точно все прочел?"
        a "Абсолютно"
        n "НУ И? Ничего не почувствовал?"
        a "Красивая история, но к сожалению лишь сплошная удача"
        n "Да это же просто нечто, их было всего четверо, а они смогли так много сделать имея так мало."
        a "Только не говори мне, что…"
        n "Мы будем делать игру!"
        a "Черт"
        "Ну как же так. Без объявления войны. Вот так просто. Он всегда был таким, подначивал на всяческие авантюры с поводом и без, а я отнекиваюсь."
        "Хотя по итогу все равно соглашаюсь… Возможно только из-за него я окончательно не превратился в амёбу."
        a "Так ладно. У тебя хоть идеи есть?"
        n "Ты даже не станешь спорить? Тебя машина недавно не сбивала? Где Артем, признавайся!"
        a "Улетел на другой край света. Подальше от надоедливого придурка."
        n "Ну есть парочка, но нам нужна команда. Как минимум еще 2 человека – сценарист и художник"
        a "Вот и ищи, на меня не надейся."
        n "Ну, пожалуйста!"
        a "..."
        "Никита попытался состроить гримасу кота в сапогах из “шрека”."
        a "Ты в курсе, что являешься той еще занозой?"
        n "Угу"
        "Мы поговорили еще пару минут о разных мелочах, я почувствовал, что начинаю замерзать. Посмотрев на осеннее небо, а потом на Никиту. Мне почему-то взбрело сказать это."
        a "Я что-нибудь придумаю, а теперь давай по домам."
        n "Ура! До встречи!"
        a "Ага"
        hide artem with dissolve
        hide nikita with dissolve
        scene artem_room
        "Придя домой, я еще долго не мог уснуть. Неужели меня и правда вдохновила вся эта история с маленькой студией или же дело в чем-то другом."
        "Точно не могу ответить на этот вопрос, по крайней мере сейчас. Кажется становится не так скучно…"
        jump cont1

        label cont1:
            scene artem_room
            "Утро в этот раз не задалось: все валилось из рук, медлительные действия, чувство разбитости. Явное проявление отсутствия здорового сна."
            "С этим нужно что-то делать, хоть мне и нравится ночная жизнь, но оставлять все так в учебное время грозит большими проблемами для организма."
            "Собравшись в школу, я кое-как приготовил себе завтрак и удалился из дома."
            scene city
            "В наушниках играли Radiohead, а я наблюдал за падающими листьями."
            "Мне очень нравится подобное спокойствие на улице, когда каждый человек идет по своим делам и думает о сегодняшнем дне, о том, что ему предстоит сделать сегодня."
            "Именно в это время большинство людей остаются наедине с собой, обдумывают свое бытие, погружаются в себя."
            scene classroom
            "Когда я зашел в класс, то понял, что чего-то не хватает. Никита еще не пришел. Это было странно, потому что он всегда приходил раньше меня на пару минут."
            "В сети он не появлялся, а значит что-то стряслось, иначе Никита точно бы предупредил."
            "Где-то на уроке третьем, я сказал, что у меня болит живот, и меня спокойно отпустили."
            scene city
            "Проходит буквально десять минут, а я уже стою у его домофона."
            "Немного постояв на месте, набираю его квартиру, на той стороне, как не странно, отвечает Никита в явно приподнятом настроении. "

            show nikita at left with dissolve:
                zoom 0.85
            n "Заходи скорее. Ты не поверишь, кто у меня сейчас дома!"
            hide nikita with dissolve

            "По правде говоря, он меня заинтересовал. Я поднялся быстрым шагом на третий этаж, открыл дверь и... замер."
            scene nikita_room_day
            "Как будто окунулся на семь лет назад. В коридоре стояла Ася, которая почти не изменилась внешне."

            "Мы были друзьями в то время. Даже больше, чем друзьями, она была нам как старшая сестра. Как и все дети, мы часто бегали во дворе, где были, как друзья, так и враги."
            "Однажды нам с Никитой повезло увидеть картину, как маленькая девочка издевалась над главным хулиганом и неприятелем всех ребят. "
            "Это была Ася. Она тогда только переехала в наш район. После такого неожиданного, для всех детей, случая, мы и сдружились с ней."
            "Из всех других ребят именно мы заинтересовали ее. Вечно унылый и невероятно гиперактивный. Для нее, видимо, это стало интересным сочетанием."
            "К сожалению, наша дружба не продлилась долго, и ее семья опять переехала в другой город, конечно, взяв с собой Асю. "
            "О ней остались множество теплых воспоминаний, я даже сейчас помню, как переживал, о том, что она уезжает. Это был второй человек в моей жизни, который мог сподвигнуть меня на всяческие активности."

            show nikita at left with dissolve:
                zoom 0.85
            show artem at center with dissolve
            show asya at right with dissolve:
                zoom 0.8
            a "Но как? Ты же уехала. Почему снова здесь?"
            asy "Может хотя-бы  “привет” выдавишь из себя?"
            asy "Ой, ладно. Родители снова решили переехать в город покрупнее для работы, а я с ними, потому что хочу попробовать себя в творческих проектах."
            asy "Здесь их явно будет больше, чем в той глухомани, в которой мы были."
            "Я простоял молча еще пару секунд и не мог поверить своим глазам. Она подошла ближе."
            asy "Быть таким высоким не честно. Пригнись."
            "Я послушался. Она обняла меня со всей силой, что было в этом маленьком человечке. Я ответил тем же."
            asy "Как же я скучала по вам!"
            n "А мы то как!"

            "Еще проболтав так в коридоре минут двадцать, Никита предложил выпить чаю, на что мы с радостью согласились."
            "Оказалось, что он встретил ее по пути в школу, отложил все свои дела, а мне не написал, потому что знал, что я прибегу к нему домой."
            asy "Никита, кстати, рассказал о ваших планах. Я в деле!"
            a "Это не что-то грандиозное, я не думаю, что ты имела в виду такие несерьезные проекты."
            if is_stay_home:
                n "Еще как серьезный! И нам как раз нужен художник. А вообще-то это ты должен был людей искать, так что спасибо должен сказать. "
            else:
                n "Еще как серьезный! А вообще я хотел тебя попросить найти людей для этого дела. Справишься?"

            a "Получается нам остался лишь геймдизайнер?"
            n "Угу. Я не знаю, как ты это сделаешь, но постарайся, пожалуйста. Мне уже не терпится начать."
            a "Так сколько тебе уже лет? Ты же нас на пару лет старше, насколько я помню."
            asy "О таком не прилично спрашивать вообще-то! В душе до сих пор тринадцать."
            a "Да просто по тебе и не скажешь, каков твой настоящий возраст."
            asy "Так это же не я вымахала до 190 за семь лет. И хватит с темы сходить. Мы обязаны сделать что-то крутое."
            n "К сожалению мы не можем начать создавать концепцию игры таким составом. Нужен геймдизайнер. Срочно."
            a "Ладно, Ладно. Я вас понял. Есть у меня один человек в знакомых. Сегодня же спишусь с ним."
            asy "Вот и договорились."
            "Тема разработки игры ушла куда-то назад, и мы продолжили разговор на отвлеченные темы. Давно я так ни с кем не беседовал в компании."
            "Ася рассказывала про свою жизнь, мы про нашу, таким образом, не заметно для всех, наступил вечер."
            scene nikita_room_night
            a "Кажется пора по домам. Ася, я тебя провожу."
            n "Удачи, ребят"
            hide nikita with dissolve
            hide artem with dissolve
            scene city
            show artem at left with dissolve
            show asya at right with dissolve:
                zoom 0.8
            "Мы вышли на улицу. Уже неплохо так стемнело"
            a "Ты же понимаешь, что в этом проекте не будет ничего серьезного. Он не пойдет куда-то далеко, не будет финансироваться."
            asy "Конечно, я все понимаю. Дело же не в этом, глупый. Да, я сказала, что хочу поучаствовать в серьезной работе, но почему я должна отказываться от опыта, который предоставит мне этот маленький инди-проект."
            asy "Артем, бери от этой жизни то, что тебе дают, не упускай возможности. Мы все от него, что-то получим для себя. Я в это верю."
            a "И ты, конечно, настроена серьезно."
            asy "А иначе зачем браться за дело?"
            "Я проводил ее прямо до двери и поплелся домой. Никита и Ася всегда хорошо ладили, а тут еще и совместная работа."
            hide asya with dissolve

            menu:
                a "Возможно, мне тоже нужно отнестись к этому посерьезнее."
                "Отложить дело":
                    jump postpone
                "Написать знакомой сегодня":
                    jump writetoday

        label postpone:
            $write_today = False
            hide artem with dissolve
            scene thinking_in_room
            "Сегодня произошло и так много событий. Думаю, это может подождать. Приду и рухну в постель, а дела не такие уж и срочные."
            "Поужинав, я быстро умылся и без сил лег спать. Надо будет как-то объясниться перед Никитой. Подумаю об этом завтра."
            scene artem_room
            "Утро было не слишком добрым. Будильники я не любил, а звонки с утра еще больше. Это был Никита, который сразу же начал расспрашивать об еще одном участнике."
            show artem at left with dissolve
            show nikita at right with dissolve:
                zoom 0.85
            n "Ну что? Нашел?"
            a "А это не может подождать? Я только проснулся."
            n "Как я и подозревал... Ладно, я уже позвал Полину к нам в команду. Встречаемся у меня через 2 часа."
            a "Прости"
            n "Ничего страшного, просто приходи вовремя."
            hide artem with dissolve
            hide nikita with dissolve
            "Это и не удивительно, он знал ее также, как я, поэтому нам обоим пришла на ум именно она. Мы познакомились с ней в какой-то MOBe, уже и не вспомню в какой."
            "Она материла союзника, который, по ее словам, сделал, что-то “максимально бездарное”. По общению она была довольна активной девушкой."
            "После того, как мы довольно сильно разговорились, оказалось, что живем в одном городе, но дальше интернет-общения не пошло."
            "Вместе с ней и Никитой играли какое-то время, но потом общение сошло на нет. По всей видимости с ним она еще продолжила общаться."
            "Вспомнили мы ее, потому что она участвовала в ролевиках и писала кампании для настольных игр."
            jump artem_mind

        label writetoday:
            hide artem with dissolve
            scene thinking_in_room
            "Я обещал Никите, а значит сделаю. Когда пришел домой, мама уже спала. Тихо поужинав, я сел за компьютер, открыл страницу Полины и долго думал, что написать."
            "Мы познакомились с ней в какой-то MOBe, уже и не вспомню в какой. Она материла союзника, который, по ее словам, сделал, что-то “максимально бездарное”."
            "По общению она была довольна активной девушкой. После того, как мы довольно сильно разговорились, оказалось, что живем в одном городе, но дальше интернет-общения не пошло."
            "Вместе с ней и Никитой играли какое-то время, но потом общение сошло на нет. Вспомнил я именно ее, потому что она участвовала в ролевиках и писала кампании для настольных игр."
            "Вместе с ней и Никитой играли какое-то время, но потом общение сошло на нет. Вспомнил я именно ее, потому что она участвовала в ролевиках и писала кампании для настольных игр."
            show artem at left with dissolve
            a "Не попробуешь - не узнаешь."
            "И я написал. Самая тяжелая минута ожидания, после прочтения сообщения в моей жизни."
            show polina at right with dissolve:
                zoom 0.85
            p "Да, почему нет. Звучит интересно, а если учесть, что за сюжетную составляющую буду отвечать я, то может выйдет не так плохо."
            a "Тогда может встретимся завтра всей компанией для небольшого брейншторма?"
            p "Договорились"
            hide artem with dissolve
            hide polina with dissolve
            "У меня получилось. Я был несказанно рад, потому что впервые я зову кого-то принять участие, а не меня. С чувством выполненного долга, я лег в кровать, и сон не заставил себя долго ждать."
            scene artem_room
            "Сегодня я проснулся гораздо раньше обычного."
            "Было это связанно с тем, что мой режим встал на место или же мне просто было невтерпеж начать думать над нашим совместным проектом, пока не ясно, но настроение у меня было явно приподнятое."
            "Скорее всего я просто до сих пор гордился тем, что самостоятельно заманил человека на какую-то авантюру. Предстоял тяжелый день общения в большой компании людей."
            hide polina with dissolve
            hide artem with dissolve
            jump artem_mind


        label artem_mind:
            "Сделав все утренние дела, я начал собираться к Никите. Волнуюсь. Первый опыт давал о себе знать. Вдруг, что-то пойдет не так и мы не придем к общим соглашениям? Но ведь для этого мы и собираемся."
            show artem at left with dissolve
            a "Надо взять себя в руки"
            hide artem with dissolve
            "Ася попросила взять меня треногу, так как оставила свою в том городе. Полностью собравшись, я пулей вылетел до Никиты."
            scene city
            if write_today:
                jump meet_polina_with_write
            else:
                jump meet_polina



        label meet_polina_with_write:
            show artem at left with dissolve:
                zoom 0.85
            show nikita at right with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.7
            n "Ты что-то рано"
            a "Ну значит вместе встретим Полину и Асю, давай собирайся"
            n "А не слишком ты активный сегодня?"
            a "Я такой же как обычно"
            n "Ты меня не проведешь. Все-таки тебе нравится вся эта затея!"
            a "Может немного."
            n "Ты не представляешь, как я рад это услышать!"
            "Никита собрался довольно быстро, и мы поспешили встретить других сокомандников. Сначала зашли за Асей, а потом пошли встречать Полину на остановку."
            asy "Вы хоть знаете, как она выглядит?"
            a "Неа"
            n "Неа"
            a "Я написал, что мы стоим компанией из трех человек прямо у остановки, думаю найдет"
            hide asya with dissolve
            show asya at center with dissolve:
                zoom 0.75
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.75
                xalign 0.68
            "И вот выходит она. Я многое ожидал от нее: крепкие объятия сразу при встрече, повышенный тон голоса, возможно даже снисходительность и высокомерность общения."
            "Но нет. Мы слышим робкое “П-привет” и сразу понимаем, что некоторые люди совершенно отличаются от своего представления в интернете. "
            n "Это точно она?"
            a "Сам не уверен, может опаздывает?"
            n "Проверь телефон"
            a "Заткнитесь и не смущайте человека! Привет, меня зовут Ася"
            p "П-приятно познакомиться. Полина."
            "И этот человек считался мной самым агрессивным игроком, которого я встречал. Обратный путь давался нам с Никитой тяжело, мы не могли отойти от шока."
            "Зато Ася очень хорошо разговорилась с Полиной, хотя было видно, что ей это тяжело дается, но она старалась втянуться в разговор."
            scene nikita_room_day
            show artem at left with dissolve:
                zoom 0.85
            show nikita at right with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.75
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.75
                xalign 0.68
            "Наконец-то мы дошли до Никиты и стали проходить в его комнату для того, чтобы обсудить игру."
            jump meeting

        label meet_polina:
            scene nikita_room_day
            show nikita at left with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.7
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.7
                xalign 0.68
            show artem at right with dissolve:
                zoom 0.85
            n "Наконец-то пришел."
            a "Да вы все в сборе уже, извините, что опоздал."
            n "Ну Полину ты уже знаешь, однако лично я понял, что похоже не так уже и хорошо."
            "На кровати сидела явно смущенная Полина. И это наш сценарист??? Ладно, я просто совсем по-другому представлял этого человека, а Ася с Никитой кажется уже привыкли."
            "Все-таки некоторые люди в отрыве от интернета ведут себя иначе."
            jump meeting

        label meeting:
            n "Итак, сегодня нам предстоит создать общую концепцию игры: обсудить сеттинг, механики, жанр, конкурентов."
            a "Сразу же хотелось бы уточнить, что бюджета у нас нет и не будет. Вывозим на чистом энтузиазме."
            asy "Раз так, то круг жанров сужается. Может визуальная новелла?"
            n "Мы, конечно, не профессионалы, но хотелось бы запрогать, что-то реально инетересное."
            asy "У меня есть опыт в графическом дизайне и анимации. Есть куда разогнаться."
            a "Я бы для начала обратился к успешным проектам других инди-студий. Super Meat Boy, Five Nights at Freddy’s, Hotline Maiami."
            "И тут начала говорить она. Уверенно, без запинки. Так, как будто уже думала об этом."
            p "Все равно в нашей игре главным воздействием на игрока будет являться сюжет, потому что как бы вы хорошо не делали свою работу, для нее нужен не один человек, а книги пишутся чаще одним автором."
            "Все уставились на нее."
            p "К-как-то так..."
            asy "А что вы молчите? Она права. У тебя уже есть какие-то идеи?"
            p "Не то что бы..."
            n "Давай не стесняйся. Ты же наш геймдизайнер!"
            p "Я всегда хотел написать какой-то хоррор, психологический триллер. Историю, заставляющую чувствовать животный страх, но без визуала такое довольно трудно сделать..."
            n "А как насчет игр, в которых подоплека сюжета проходит через сами механики."
            n "В той же “Hotline Maiami” драйвовая музыка резко прекращается, после каждого пройденного уровня, и остается только шум в ушах героя, что указывает на его состояния во время всей этой жестокости, что он совершает. "
            asy "Мы что-то углубились в детали, не имея ничего из заготовок. Я предлагаю взять графику как в “Dead cells”, “Katana zero”, “Hotline Maiami”."
            asy "Кто-то против? А теперь выдвигайте свои идеи по поводу сюжета и сеттинга. Начинать двигаться надо от этого."
            a "Хорошая идея."
            "Именно после слов Аси обсуждения пошло быстрее. Возможно, она и правда прирожденный лидер."
            "Остановились наши размышления на нуар сеттинге, а именно детективная история с ужасающим убийцей. Таким образом мы учли предпочтения Полины, она была рада, что ей дали прописать такой сюжет."
            "Чтобы его хорошо подать, мы выбрали жанр ролевой игры с добавлением платформинга и экшена в определнные моменты психологического состояния героя."
            "На этом мы решили закончить обсуждения и ждать прописанного сюжета и героев, для их отрисовки и добавления в игру."
            asy "Хорошо поработали, ребята! Полина тебе понравилось?"
            p "Было весело..."
            n "Ждем от тебя наброски сюжета и начинаем приступать к работе!"
            p "Я постараюсь."
            a "Долго же мы сидели. Уже стемнело."
            scene nikita_room_night
            show nikita at left with dissolve:
                zoom 0.75
            n "Зато как много всего обсудили, а теперь идите отдыхайте."
            hide nikita with dissolve
            "Мы благополучно вышли из дома Никиты и побрели до остановки."
            scene city
            "Проводив Полину, по пути домой Ася безостановочно рассказывала о своих дизайнерских решениях по поводу локаций, а я слушал так внимательно, что не упустил ни одну деталь."
            show artem at left with dissolve
            show asya at right with dissolve:
                zoom 0.8
            asy "Все таки я рада, что мы занялись этим делом. Я чувствую командный дух!"
            a "Получилось и правда неплохо, надеюсь так пойдет и дальше. Что-то типа плана уже составлено, осталось ему следовать."
            asy "А этот проект у тебя тоже был по плану?"
            a "Конечно нет."
            asy "Главное, что мы получаем удовольствие от этого дела."
            a "И то верно. До скорого!"
            asy "Удачи"
            hide asya with dissolve
            hide artem with dissolve
            "Хорошо, что до дома было не так далеко. С этими обсуждениями я был совсем без сил."
            scene thinking_in_room
            "Наконец-то придя домой, я сразу лег в кровать. Мне и правда было весело сегодня."
            "Раньше я только наблюдал за тем, как создают, что-то свое, а теперь сам участвую в таком деле. От усталости мысли путались, и сон пришел быстрее обычного."
            scene artem_room
            "Работа над проектом шла полным ходом: Полина писала сценарий, Ася накидывала концепт-арты персонажей и лвлов, а мы с Никитой уже выбрали движок на котором станем писать игру."
            "Подготовка к основной части разработки уже подходила к концу и настал этап прототипирования, поэтому мы решили собраться, дабы обсудить дальнейшие действия команды."
            "В этот раз принимать гостей пришлось мне, так как у Никиты в гостях были родственники, а моя мать как раз уехала к бабушке на все выходные."
            "Я встал пораньше, потому что приводить Никиту в неубранную комнату себе дороже."
            "Помню, как в детстве я пригласил его в гости поиграть в приставку, а потом пойти гулять, но вместо этого мы целый день прибирались и никуда не пошли."
            "После этого в гости я звал его редко. Очень редко."
            "Вычистив все по полной программе, уже подходило время встречи, и я услышал звонок в дверь. Никита первый ворвался в мою комнату и начал все судорожно осматривать. "

            show artem at left with dissolve:
                zoom 0.85
            show nikita at right with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.75
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.75
                xalign 0.68

            a "Ну как тебе?"
            n "Не идеально, но тебе пойду на уступки. Это что моя фигурка человека паука?"
            a "Давайте приступим к работе."
            n "Я ее с 8 лет не видел!"
            asy "Полина сказала, что основная часть сюжета готова и можно начинать работать над ветвлениями истории, диалогами, и отношениями персонажей."
            asy "Я же нарисовала множество концепт-артов, которые уже можно моделировать и создавать скелет игры."
            "В этот день мы наконец-то закрепили позиции и обязанности каждого в проекте."
            "Полина отвечает за все сюжетные части игры, нарративы, взаимоотношения персонажей, подсказывает дизайнеру оформление локаций и героев."
            "Ася занимается анимацией и моделированием. Я прописываю поведение персонажей в программе и помогаю в работе дизайнера."
            "Никита же отвечает за геймплей и механики игры."
            "Следующей целью мы выбрали создание макета игры. Добавить какие-то базовые механики, чтобы побегать и опробовать как будет выглядеть игра."
            asy "Не хочется медлить, давайте начнем сейчас."
            "Кажется, я совсем не ожидал, что мы начнем над этим работу в ту же секунду после обсуждения."
            "По концепт-артам Ася начала моделировать персонажа и добавлять к нему анимации. С первым помогала Полина, а со вторым я."
            n "Работа над локацией будет происходить долго, так что давайте просто создадим платформу, на которой персонаж может побегать."
            "Уже подключился Никита, который оживил нашего героя."
            p "Создать локацию и уже будет выглядеть, как настоящая игра!"
            asy "Я думаю мы с Артемом можем подзадержаться сегодня. Так ведь?"
            a "Не думаю, что у меня есть выбор, когда ты так спрашиваешь."
            asy "И правильно думаешь."
            "Полина дала некоторые рекомендации по оформлению первой локации Асе, а Никита на доступном языке объяснил мне как работает его геймплейный код, чтобы мы могли добавить его на новую локацию."
            hide nikita with dissolve
            hide polina with dissolve
            hide artem with dissolve
            hide asya with dissolve

            show artem at left with dissolve
            show asya at right with dissolve:
                zoom 0.8

            "И вот мы остались вдвоем. Я принес нам чая с печеньками, и началась работа над оформлением лвла."
            "Пока Ася занималась локацией и ей не требовалась моя помощь, мой ум был занят оформлением диалогового окна - одной из главных составляющих ролевой игры."
            "Был выходной поэтому мы решили работать до отказа. А точнее это решила Ася."
            "Наконец-то макет локации был готов. Мы добавили одного болванчика и создали с ним один из сценарных диалогов с вариантами ответов."
            a "Пока выходит неплохо. Надо доработать окружение, добавить персонажей из сюжета, механик, которые придумал Никита, и будет полноценный пролог игры. Ася?"
            "Я так увлекся, что не заметил, как Ася тихо задремала прямо за столом. Оно и не удивительно, время было позднее."
            scene thinking_in_room
            show artem at left with dissolve
            show asya at right with dissolve:
                zoom 0.8
            "Я выключил компы, свет,  пернес Асю на свою кровать, а сам расположился на полу. Спустя некоторое время молчания Ася вдруг заговорила"
            asy "И не думай ничего постыдного, я просто устала сегодня."
            a "Ни в коем случае. Спи."
            asy "Мог и разбудить, чтобы я пошла домой."
            a "Уже поздно, а мне лень тебя провожать. Не переживай, просто спи."
            "Кажется, Ася окончательно уснула. Оказывается, она говорит во сне. Этого я точно не ожидал. Бормотала, что-то про анимацию, а мне пришлось включить музыку, чтобы спокойно уснуть. "
            scene artem_room
            show artem at left with dissolve
            show asya at right with dissolve:
                zoom 0.8

            "В этот раз мне не спалось больше обычного, ведь у меня в комнате спала девушка, поэтому проснулся я в довольно разбитом состоянии."
            "Как будто понимая это, Ася стояла на кухне и готовила завтрак. Ее еще мокрые волосы блестели в свете осеннего солнца, освещая все помещение."
            "За окном день шел полным ходом, а я как будто до сих пор спал, наблюдая за этой картиной."
            a "Ты, кажется, вообще не умеешь отсыпаться"
            asy "В жизни жаворонка есть и свои плюсы. Перестань ворчать и садись есть."
            a "У тебя разве своих дел дома мало, чего ты возишься со мной."
            asy "Ну как я оставлю тебя одного без еды. Ты же совсем еще маленький и несмышленый."
            a "Это я то?"
            asy "А кто еще?"
            a "Кажется ты застряла в прошлом. Мне уже не нужно подтирать сопли после любой мелочи."
            asy "Как раз таки наоборот. Да может ты и вымахал за эти несколько лет, но в душе совсем ребенок."
            if is_stay_home and write_today:
                asy "Хотя в последнее время замечаю, что ты начинаешь тянуться к людям, а не избегать их, как ребенок. Даже сам Полине написал."
                a "Мне просто показалось это интересной мыслью"
                asy "Можешь отрицать сколько угодно, но ты меняешься. Меня это радует"
                jump retort
            elif not is_stay_home and not write_today:
                a "Ты все также избегаешь людей и возможностей. Не выходишь из зоны комфорта."
                jump retort
            jump talk_with_asya_at_home

        label retort:
        menu:
            "Возразить":
                jump is_retort
            "Согласиться":
                jump is_agree

        label is_retort:
            a "Мне это не нужно, меня устраивает моя жизнь и мои принципы."
            asy "Вот об этом я и говорю. Может тебе стоит задуматься об этом?"
            a "Я так не думаю. Я просто не способен на то, что делают другие люди."
            asy "Я уже устала повторять, что это ошибочное мышление. Возможно твое мнение изменится, но будет поздно, когда ты поймешь откуда появляется интерес к жизни у людей."
            asy "Никто просто не останется рядом."
            a "А ты понимаешь?"
            asy "Я не стану это разжевывать, мне бы хотелось, чтобы ты сам это понял. Возможно, этот проект и подскажет тебе в чем сущность этих вещей."
            a "Ты же не считаешь, что твое мнение это истина в последней инстанции. Зачем учить меня жить?"
            asy "Потому что я понимаю, что для тебя осознание, как люди находят в себе мотивацию на действие, очень важно."
            asy "У тебя огромный потенциал, которым ты совсем не пользуешься. Аппетит пропал. Думаю, я пойду."
            a "Прости, что так резко."
            "Ася лишь улыбнулась своей яркой улыбкой и ушла собираться домой."
            "Вечно меня поучают. Почему я не могу иметь свой взгляд на мир. Тусклый, но, как мне кажется, правдивый."
            "На последней встрече мы решили взять перерыв на эти выходные, чтобы все отдохнули и новые мысли приходили команде, поэтому после ухода Аси, я не нашел дел лучше, чем поиграть в этот остаток выходных."
            jump talk_with_asya_at_home

        label is_agree:
            a "Думаешь стоит меняться?"
            asy "Я не говорю тебе, что делать, но по моим наблюдениям ты гораздо счастливее, когда участвуешь в жизни других людей, берешь от них что-то новое."
            asy "Охотнее принимаешь участие в том, что тебе нравится и не так боишься облажаться. Думаю, да. Тебе стоит меняться."
            a "В твоих словах имеется смысл, но как меняться, когда всю жизнь прожил с подобными установками."
            asy "Не смеши меня, Артем. Да это тяжело, но как тебе будет радостнее жить после. Подумай об этом."
            a "Приму к сведению, спасибо..."
            jump talk_with_asya_at_home

        label talk_with_asya_at_home:
            "Мы еще побеседовали о некоторых мелочах в сфере анимации и похоже, что ей срочно требовалось посмотреть на архитектуру некоторых зданий для воссоздания качественной графики в игре."
            asy "Может нам всем вместе отправиться в Санкт-Петербург?! Там здания, прямо то, что нужно для нашей нуар-игры."
            a "Можно поспрашивать остальных. Лично я не против, у меня скопились некоторые средства, на поездку точно хватит."
            "Мы созвонились с остальными ребятами, в Никите у меня не было сомнений, он всегда за подобные авантюры."
            "Но вот Полина... Как же я был удивлен, когда она без раздумий сказала - “Конечно!”"
            "На этом моменте я вспомнил Достоевского с его мрачными книгами, и реакция Полины стала ясна, как небо."
            asy "У моих малышей, как раз скоро осенние каникулы. В это время и поедем."
            a "Не называй нас так, пожалуйста."
            asy "А кто мне что сделает!"
            a "Безработная."
            asy "Сейчас кому-то прилетит."
            "На этом наше обсуждение неожиданной поездки закончилось, и Ася начала собираться домой."
            a "Спасибо тебе. Я обдумаю твои слова, насчет меня."
            asy "А ты быстро учишься. До скорого!"
            a "До встречи."
            "Так как наша команда решила взять небольшой выходной, я решил и правда чуть отойти от наших дел и провести их с самим собой. Как раз будет время на обдумывание слов Аси..."
            hide asya with dissolve
            hide artem with dissolve
            if not is_retort:
                "Все очень ждали эту поездку, и чтобы скрасить ожидания каждый погрузился в свою часть работы."
                "Мы с Никитой продумывали искусственный интеллект и ролевые механики игры, Полина дописывала сюжет, а Ася писала четкий план того, на что она хочет обратить свое внимания в Петербурге."
            else:
                "Выходные прошли, и каждый дорабатывал свою часть проекта, однако от Аси не было никаких идей или наработок, что нас очень озадачило."
                "Мы с Никитой решили выяснить, что пошло не так, не нужна ли ей какая-то помощь."
                "Если честно чувствовал я себя виновато перед ней, поэтому и предложил сделать это лично, а не в интернете."
                scene city
                "Встретившись во дворе, мы выдвинулись до Аси, попутно обсуждая ролевые механики игры и новые детали сюжета от Полины."

                show artem at left with dissolve:
                    zoom 0.85
                show nikita at right with dissolve:
                    zoom 0.75

                n "Жаль, что мы не обладаем такими же средствами, как AAA компании. Нельзя реализовать все задумки или создать сногсшибательную графику."
                "Может поэтому Ася давно ничего не показывала нам?"
                a "Сейчас и узнаем."
                "Дойдя до ее дома, мы набрали Асю, чтобы она вышла к нам на улицу. В гости заходить было неудобно, ведь у нее довольно большая семья."
                "Она вышла к нам и с виду была не в очень хорошем настроении, хоть и пыталась скрыть это улыбкой."
                show asya at center with dissolve:
                    zoom 0.75
                a "Что у тебя стряслось?!"
                n "Что у тебя стряслось?!"
                "Мы с Никитой неловко переглянулись."
                asy "Да ничего не случилось, просто у меня напрочь отсутствуют идеи, из-за недостатка насмотренности."
                n "Ты имеешь в виду архитектуру зданий и оформление локаций?"
                a "Ну а что еще по-твоему? У меня была идея съездить в Санкт-Петербург, но я сомневалась в том, согласитесь ли вы."
                "В этом высказывании я заподозрил ехидство и наглую ложь. Никита же точно согласится на это!"
                n "Конечно, я за! Что может быть лучше совместной поездки, так еще  и по делу!"
                "Они посмотрели на меня с некоторыми сомнениями в глазах"
                a "У меня нет выбора, я правильно понимаю?"
                asy "Я уже спросила Полину, и она двумя руками за, а у нас, между прочим, демократия. Через пару дней у вас каникулы в это время и поедем."
                "Вот же оно! Она все обставила так, чтобы теперь я точно поехал"
                n "Уже жду с нетерпением."
                a "Ладно, пошли сообщим родителям."
                asy "И это я уже сделала!"
                "Не могу поверить, что меня так переиграли. Мне только, что поставили детский мат. Это и было ее изначальным планом."
                asy "Твоя мама попросила меня присмотреть за тобой. Не бойся, тебя я в обиду не дам."
                a "Ой, все. Если больше тем для насмешек не будет, то я, пожалуй, пойду собираться. "
                asy "Слюнявчик не забудь."
                a "Да, да, да. Очень смешно."
                hide asya with dissolve
                "Мы с Никитой пошли по домам и стали готовиться к предстоящей поездке."
                hide nikita with dissolve
                "Мне не особо понравилось, что все это решается без меня, но так было всегда и будет дальше. Остается только смиренно соглашаться с поставленными мне условиями."

            scene city
            show artem at left with dissolve
            "И вот настал день X. Мы собрались, чтобы поехать в аэропорт."
            "Для всех это было довольно волнительно, так как никто из нас никогда не летал до этого."
            "Было забавно наблюдать, как робкая Полина успокаивала Асю, у которой тряслись коленки с каждым объявлением рейса."
            "Сам путь занял не долгое время, и сразу после приземления и мольбы Аси всем богам за удачный полет, мы отправились на съемную квартиру."
            "Окончательно освоившись, Ася уже сгорала от нетерпения выйти на центральные улицы города."
            show artem at left with dissolve:
                zoom 0.85
            show nikita at right with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.75
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.75
                xalign 0.68
            asy "Чего вы все разлеглись, у нас и так времени в обрез."
            a "Еще пять минуточек..."
            asy "Встаем!!! У нас уйма дел."
            n "И правда, лежать что-ли приехали?"
            a "Видимо я здесь один, кто хочет немного отдохнуть после полета. Сама-то вся тряслась."
            asy "Все в прошлом, я готова на риски ради дела!"
            scene travel_in_city
            show artem at left with dissolve:
                zoom 0.85
            show nikita at right with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.75
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.75
                xalign 0.68
            "Пришлось под командованием Аси идти во все места, которые она хотела повидать."
            "Кокушкин и Благовещенский мосты, городские дворы “колодцы”, а также некоторые знаменитые здания на Казначейской 7 и Столярной 5."
            "Полина была просто в восторге, а Ася с горящими глазами вела нас всюду за собой. Делая перерывы на прием пищи, мы продолжали гулять по улицам этого прекрасного, но в то же время душащего города."
            "Что там говорить, даже я проникся и совсем не чувствовал усталости к вечеру, но пора было возвращаться на квартиру, так как наши ноги говорили об обратном."
            asy "Вот это день! Я просто преисполнилась и готова хоть сейчас вам рисовать, все что вы попросите."
            a "Получилось и правда неплохо, рад что тебя это так зарядило."
            "Мы посмотрели на ребят и улыбнулись. Никита уснул в одежде прямо на кресле, а Полина уже видела третий сон на лежа на диване. "
            a "Похоже ты совсем нас вымотала."
            asy "И это еще не все. Пусть отдыхают, завтра нас ждет не меньше дел."
            "Мы разбрелись по своим комнатам в ожидании нового, полного открытий дня."
            "Следующие пару дней прошли практически в одно мгновенье. Мы гуляли, смеялись, чудачили, много разговаривали. Нашему счастью не было предела."
            "Я смотрел на своих друзей и не мог не заряжаться от них этой сильной и яркой энергией. Эта поездка всем принесла мотивации и сил для того, чтобы закончить наш проект, за что спасибо Асе."
            "Как будто этот отдых и просвещение открыло в нас путь, из которого тонной лились идеи и мысли."
            "Шел последний день нашего пребывания в Санкт-Петербурге, и в этот момент Ася поняла, что она совсем не запечатлила этот момент."
            asy "Мы должны сфоткаться!"
            n "Мысль хорошая."
            p "Все-таки я не зря брала с собой пленочный фотоаппарат. Там как раз пленки на пару снимков."
            "Мы попросили случайного прохожего сфотографировать нас."
            n "Надеюсь ничего на смазалось."
            p "Как приедем домой, я проявлю пленку и каждому отправлю."
            "В последние часы прогулки по городу всем было тоскливо, что наше путешествие на этом закончилось, но каждый испытал уйму невероятных эмоций."
            "Думаю, для всех эти несколько дней запомнятся надолго."
            "Вот мы уже и сидим в аэропорте, Никита общается с мамой, Полина что-то читает, а Ася с увлечением рисует какие-то наброски для игры."
            hide artem with dissolve
            hide asya with dissolve
            hide polina with dissolve
            hide nikita with dissolve
            scene thinking_in_room
            "Что же до меня? Честно говоря, я не до конца понимал, что ощущаю. "
            "Мне было незнакомо такое чувство вовлеченности во что-либо, но в этой поездке я как будто погрузился в своих друзей, их переживания, эмоции."
            "Я одновременно пугался и желал этих чувств, но совсем не знал, как поступить правильно. Бежать от них или принять, как нечто свое. Это мне еще предстояло узнать."
            "Дни шли своим чередом, прошла осень, зима, первые месяца весны. Каждый трудился над своей частью игры с невероятным усилием, после той самой поездки."
            "В то же время нам с Никитой нужно было готовиться к итоговым экзаменам в школе."
            "Я точно не знал, куда хотел поступать, поэтому выбрал предметы, по которым в школе всегда был неплох, а дальше будь что будет. Я точно знал, что не завалю эти экзамены, поэтому все мои крупицы энергии вкладывал в создание игры."
            "Вопрос о моей вовлеченности в процесс все также оставался открытым для меня."
            "Год назад я вёл бы себя совсем иначе: пресечение попыток своих друзей на совместные действия, игнорирование их эмоций, моментальный отказ в просьбах."
            "Все это было частью меня долгие года…"
            "Дни шли своим чередом, мы делали игру. Если так подумать, то это самый активный год в моей жизни. Практически каждый день был пропитан работой над проектом."
            "Полина написала нечто невероятное, то что трогает за душу, Ася никогда не рисовала так живо и детально, Никита так вообще за этот год будто получил образование в сфере программирования."
            "Не сосчитать сколько литературы и обучающих видео посмотрел этот человек. Не обошли стороной и новые знакомства."
            "Никита все время общался с более состоявшемися разработчиками, спрашивал советы, делился некоторыми деталями и нашей игры."
            "Однако, в любой истории есть взлёты и падения, и наша не является исключением."
            show artem at left with dissolve
            show nikita at right with dissolve:
                zoom 0.85
            n "Готова! Она готова!"
            "Мне не было трудно понять о чем говорит, этот человек-мегафон. Да, он говорил о первой демке нашего творения."
            a "И ты, конечно, решил позвонить в такую рань, чтобы это сказать. Погоди, ты вообще спал?"
            n "Хотелось закончить пораньше, а раз у меня были все материалы, я не удержался…"
            a "Отсылай всем, наконец-то поиграем."
            hide nikita with dissolve
            hide artem with dissolve
            "Мы созвонились в дискорде, где Ася задала всем задание играть, не отвлекаясь ни на что."
            "Главное условие было проходить ее, как наш потенциальный потребитель, который  увидит такую игру на просторах интернета."
            "Мы еще не решили все эти скучные вещи по маркетингу и продвижению игры, да и не особо надеялись на что-то. В продвижении игры интереса было не так много."
            "Итак, все разошлись и приступили к прохождению. Конечно, я уже знал почти каждую мелкую деталь в игре, но когда ты идёшь по сюжету, используешь игровые механики, управляешь своим персонажем, это совсем иное чувство."
            "По хронометражу игра не была сильно большая. Я на одном дыхании прошёл на плохую концовку за два с половиной часа, подметил несколько мелких багов, которые нужно исправить, но в общем и целом был доволен тем, что получилось в итоге."
            "Для игры, которую делали три энтузиаста и один эмоциональный калека, получилось очень мощно."
            "Созвонившись, ещё раз мы обсудили баги, которые смогли обнаружить, и принялись их исправлять. Требовалось чуть больше времени, чем рассчитывали, поэтому отложили это дело."
            "Было принято решение, что игра выйдет в общий доступ через пару недель, когда мы точно будем уверены, в её готовности."
            scene classroom
            show artem at left with dissolve
            show nikita at right with dissolve:
                zoom 0.85

            "Снова начались скучные будни. Я с Никитой бродил по школе и о чем-то увлечённо беседовал, как вдруг краем уха слышу это."
            "'Я не нашёл ее в открытом доступе, но кажется уже все успели поиграть в это.'"
            "'Уже даже легенды складывают об этой игре на некоторых игровых форумах, но она и правда хороша, этот нуарный антураж и мрачный сюжет также придаёт ей таинственности и подпитывает легенды.'"
            a "Извини, про какую игру ты говоришь?"
            "Сказать, что мы были в шоке, значит ничего не сказать. Мальчик в подробностях описал нашу игру. Рассказал даже про неожиданные концовки и конкретные эпизоды истории."
            n "Может это просто очень похожая игра?"
            a "Кажется, у нас большие проблемы."

            "Было решено собраться всей командой для того, чтобы понять, что же такое происходи и почему про нашу игру знаем уже не только мы."
            "Мы пошарились на форумах, где и правда обсуждали её, как и то что у игры нет автора, а кто- то уже заявлял, что она его, но на таких никто не обращал внимания, так как кроме слов, у них не было других доказательств."
            scene nikita_room_day
            show artem at left with dissolve:
                zoom 0.85
            show nikita at right with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.75
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.75
                xalign 0.68
            asy "И что вы думаете?"
            p "Мою историю уже присваивают люди из интернета, какой же бред они пишут в объяснениях концовок."
            n "Для начала, давайте не паниковать."
            a "Нужно как можно скорее выставлять игру на площадку. Но как вообще наши материалы, с наших компьютеров попали куда-то ещё?"
            asy "Может какие-то мошенники?"
            menu:
                n "Да кому нужна игра от четырёх любителей?"
                "Начать рассуждать":
                    jump reason
                "Не придавать значения":
                    jump mo_matter

        label reason:
            is_no_matter = False
            a "Не могло же это само отправиться нескольким людям без нашего ведома."
            a "Ася, к примеру взять тебя, ты говорила, что хотела бы взяться за какие то перспективные проекты, может скидывала кому-то игру в качестве резюме?"
            asy "Ты правда думаешь, что я бы поступила подобным образом? Не спросив у вас?"
            a "Я просто предполагаю. Что насчёт тебя, Никита? Я знаю, что ты много обсуждал с другими программистами нашу игру."
            n "Артём, нет ничего хорошего, в том, что ты сейчас делаешь. Может найдём более разумное объяснение, если оно вообще требуется."
            p "Все так старались над этой игрой, я не думаю, что кто-то без веских причин стал сливать её непричастным к нашему делу людям."
            a "У вас всех есть мечты и стремления, будь у меня подобное чувство и желание, то, возможно, поступил бы также…"
            n "Никто бы в здравом уме не стал делать этого, и мне жаль, что ты можешь так про нас подумать, но, к всеобщему сожалению, ты  не знаком с таким понятием, как «мечта», поэтому не можешь здраво рассуждать на эту тему."
            a "Да, мне и правда не удавалось найти свою мечту, но почему мне нельзя высказать предположения, если на то есть основания?"
            n "Нет никаких оснований, это называется «недоверие». Ты просто не сформировавшаяся личность и не понимаешь ничего в здоровых отношениях между людьми."
            a "Я никогда не отрицал этого."
            n "Очень жаль, что не научился этому за столь долгое время проведённое с нами."
            asy "Ребята, успокойтесь, пожалуйста. Кидаясь друг в друга обвинениями, мы ничего не добьемся."
            n "Ася права. Гораздо важнее выяснить, что сейчас делать с нашей игрой."
            p "Полина: На самом деле, если так подумать, то у нас есть практически все стадии разработки игры и соответствующие даты, поэтому и волноваться не о чем."
            a "Тогда можно приступать к выпуску игры на steam direct, к примеру."
            n "Так и сделаем."
            p "Я займусь всеми бумажками, а вы подготовьте полную версию игры."
            "Внезапно, в комнату Никиты неловко постучали. Это был его младший брат."
            n "Витя, ты сейчас не вовремя, мы заняты."
            v "Прости, я просто услышал о чем вы говорите…"
            "Он выглядел так, будто сейчас разразиться океаном из слез."
            v "Это все моя вина… Я-я сидел в твоём компьютере и н-нашёл вашу игру… Мне она очень понравилась и я скинул её всем своим друзьям. Простите меня!"
            n "Эй, ничего страшного, все в порядке, сходи умойся. Мы все исправим, не переживай."
            "Все выдохнули с облегчением."
            a "Забавно вышло."
            n "Да уж."
            asy "Знаете, а может стоит это считать частью маркетинга?"
            a "Если кто-то уже не выложил игру под своим именем, то конечно."
            asy "Всё будет в порядке, я верю в это."
            a "Ну раз ты веришь…"
            asy "Да замолчи уже. Извинился лучше бы."
            a "Я же просто предполагал, чего вы взъелись."
            n "Ладно, не суть. Давайте закончим дело."
            jump end_history

        label no_matter:
            a "Ладно, я не думаю, что это важно. Для нас приоритетней поскорее выпустить игру на какую-нибудь площадку, чем выяснять кто виноват. "
            n "Да и кому это из нас нужно в принципе."
            a "Ты прав."
            "Пока мы разбирались на какую площадку будет легче всего залить наше творение, к нам зашел младший брат Никиты."
            v "Никит, а ты можешь сказать, что это за игра у тебя на компьютере, просто не могу нигде найти её."
            n "Погоди, а ты случаем её не скидывал никому?"
            v "Ну, я рассказал о ней друзьям, их так затянуло, что они очень захотели поиграть в неё самостоятельно, но нигде не нашли её, поэтому я просто скинул им игру целиком."
            n "ЧТО ТЫ СДЕЛАЛ?"
            a "А вот и наш мошенник."
            v "Что-то не так?"
            n "Сколько раз я тебе говорил не играть на моем компьютере?"
            "После небольшого урока воспитания подрастающего поколения, мы все немного успокоились и продолжили заниматься более важными делами."
            n "Простите меня, ребята."
            asy "Не бери в голову, с каждым могло случиться. Почаще посвящай брата в свои дела. Как он вообще не узнал ничего об этом за все это время?"
            n "Мы как то не особенно обсуждали мои дела…"
            jump end_history

        label end_history:
            scene artem_room
            "Настал самый скучный для меня этап разработки, однако Никита даже в этом нашёл, что-то интересное."
            "Он начал активно вести сообщество, где подробнее говорил о нашей игре, назначил дату выхода, и у нас даже появилось несколько фанатов. "
            "В основном это люди со школы, но хоть кто-то кроме нас ждал её. Ася создала страницу в магазине Steam, а через 30 дней после заявления, нам одобрили разрешение на загрузку игры."
            "Про инцидент с Витей как-то все благополучно забыли, ведь во всяком случае мы спокойно могли предоставить доказательства на правообладание."
            if (is_agree + is_no_matter + is_retort + is_stay_home) >= 2:
                jump good_continue
            else
                jump bad_continue



        label good_continue:
            "Долгожданный день выхода игры наконец-то наступил, и мы решили отметить это событие сразу после сдачи всех школьных экзаменов у меня дома."
            show artem at left with dissolve:
                zoom 0.85
            show nikita at right with dissolve:
                zoom 0.75
            show asya at center with dissolve:
                zoom 0.75
                xalign 0.33
            show polina at center with dissolve:
                zoom 0.75
                xalign 0.68
            a "Полина, Никита, решили куда поступать будете?"
            n "Да, в наш федеральный вуз на какое-нибудь IT направление."
            p "Что-то связанное с лингвистикой..."
            n "А ты еще не определился, как я понимаю."
            a "Да как-то не о том мысли были, а тут прижало."
            n "Может тогда попробуешь, куда и я?"
            a "А ты прям ищешь себе конкурентов."
            n "Сдал я все равно лучше тебя."
            a "Ну можно попробовать, почему нет."
            asy "А это нормально, что такое важное решение в жизни каждого школьника, ты принял за пару секунд?"
            a "За этот проект я немало что понял, одна из таких вещей, это окружение. С таким человеком, как Никита, я всегда найду себе место."
            n "Если ты про обучение, то списывать не дам."
            a "Нет, я не об этом. Эй, когда это я у тебя скатывал?"
            "Ася улыбнулась так, будто наконец-то произошло то, чего она так долго ждала"
            a "А ты куда, Ась?"
            asy "Даже не знаю пока. Буду ждать у моря погоды, пока не подвернется интересный проект, а пока буду прокачиваться, как графический дизайнер. Но скорее всего сама куда-нибудь проникну, не смогу я сидеть долго на одном месте."
            n "Да, это про тебя. Может как-нибудь повторим, подобное?"
            asy "Пообещайте мне, что позовете меня в следующий раз в свои проекты!"
            a "Ты незаменима, куда нам без тебя."
            "Мы посидели так еще несколько часов, обсуждая планы на будущее. Уже стемнело и все начали потихоньку расходиться.  Я вышел прогуляться с Никитой вдоль нашего двора."
            n "Что ты имел в виду тогда?"
            a "Не знаю, как объяснить. Вы, ребята, такие амбициозные и перспективные, такое чувство, что за время разработки игры, я стал приближаться к такому же состоянию."
            a "Мне хочется быть инициатором подобных дел, самому решать, чем и когда заняться, а увлечения не останавливаются на этапе “попробовать”."
            a "Кажется, я и правда изменился за этот год, и все это благодаря вам."
            n "Значит, Ася своего добилась. Ты наконец-то понял, что двигает тебя в этой жизни."
            a "Похоже на то. Слушай у меня тут пару идей есть по поводу следующего нашего проекта..."
            "Хороший конец"
            jump end

        label bad_continue:
            "Наступил день выхода нашей игры на платформу. За этот год мы неплохо постарались и создали неплохой инди-проект, однако без грамотного маркетинга о нем вряд ли узнает много людей, что мы знали с самого начала."
            "Дело было окончено, и наша команда распустилась сразу после выхода игры, так как никто не предложил вариантов развития. Каждый пошел по своему пути."
            "Не могу сказать, как эта игра повлияла на мою жизнь. Было весело разрабатывать что-то свое вместе со своими единомышленниками, но стал ли я лучше за этот год? Не могу сказать."
            "Мне все также не хватает искры в своих начинаниях, а интерес улетучивается спустя пару попыток заняться делом."
            "После экзаменов поступил на специальность, связанную с IT сферой, потому что много думал о том, что же двигало мной во время разработки той самой игры."
            "Почему меня увлекло это настолько сильно? Испытаю ли я то же самое, что и тогда? Меня очень цеплял тот год и эти воспоминания, хотелось вновь с головой погрузиться в нечто подобное."
            "Прилежное обучение наскучило мне практически моментально, я опять делал все из-под палки. Мой пыл стих, а эмоциональное состояние вернулось в точку, где еще не было нашей игры и команды."
            "Привычное, тусклое существование, не имеющее никакого смысла."
            "Конец первого курса, студенты сдавали уже последние экзамены из сессии. Не то чтобы я очень ждал летних каникул, но было приятно осознавать, что у моей лени будет оправдание."
            "Был вечер. Устав заучивать свой последний экзамен, я решил, что на этом хватит и пора бы уже немного выспаться. Я откинулся на кресле, а мой взгляд зацепила фотография в рамке, стоящая у меня на столе."
            "Это была поездка в Санкт-Петербург. Я часто смотрел на нее в тягостные времена, и становилось легче, но в этот раз мне стало невероятно тоскливо."
            "Я снова вспомнил то время, то, как нам было увлекательно заниматься этим. Мои грёзы прервал звонок на телефон. Это был Никита. В последний раз мы общались, когда обсуждали кто и куда поступил."
            show artem at left with dissolve
            show nikita at right with dissolve:
                zoom 0.85
            n "Привет."
            a "Чего так внезапно?"
            n "Выйдешь на улицу?"
            a "У меня завтра экзамен, знаешь ли."
            n "Ожидаемый ответ. Тогда пок..."
            a "Конечно выйду."
            n "Я жду"
            scene city
            "Я накинул ветровку и выбежал во двор."
            show artem at left with dissolve
            show nikita at right with dissolve:
                zoom 0.85
            n "Давно не виделись"
            a "Да, давненько. Как учеба?"
            n "Давай о чем-то менее скучном. Я по делу, а не проводить светские беседы."
            a "Ну и что предложишь?"
            n "В институте познакомился с амбициозными ребятами, которые горят идеей сделать хорошую игру. По наработкам выглядит очень даже неплохо. Не хочешь присоединиться?"
            a "Даже не знаю, думаешь я настолько нужен вашей команде?"
            n "Я просто даю тебе второй шанс."
            a "Второй шанс для чего?"
            n "А это ты мне сам, надеюсь, позже расскажешь."
            "Небо укутано одеялом из звезд, ветер раздувает мои волосы в разные стороны, а я как будто вновь начал жить."
            "Плохой конец"
            jump end

        label end:
            return
