# Вы можете расположить сценарий своей игры в этом файле.

# Определение персонажей игры.
define a = Character('Артём', color="#c8ffc8")
define n = Character('Никита', color="#23f5")

# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

$stay_home = True
# Игра начинается здесь:
label start:

    scene back1
    "8:30. Первые мысли после пробуждения сразу врезаются в голову с неистовой скоростью. Пара секунд и приходит осознание, что начался ещё один день. Снова."
    "*звон будильника*"

    show artem at left
    a "Чёрт! Не стоило мне так долго играть этой ночью. Как бы я быстро не собирался все равно опоздаю. Сил нет снова выслушивать упреки в мою сторону. Думаю, у меня отличный повод никуда сегодня не пойти."
    a "Все равно этот день ничем не будет отличаться от предыдущих. Ничего нового. Скука."
    hide artem

    "Посмотрев по сторонам, я увидел в углу пыльную гитару, которая как будто плачет  от того, что ей никто не хочет пользоваться."
    "На шкафу лежит волейбольный мяч, там же расположены недочитанные мной книги, а около жужжащего компьютера аккуратно стоят нетронутые холсты и запечатанные кисти."

    "Я сгреб все лишнее со стола в небольшую кучу, освободив место для рук, и, как обычно, первым делом открыл ютуб.  Процесс пробуждения почти подходил к концу, мой живот издал резкий урчащий звук. "

    show artem at left with dissolve
    a "Пора бы и перекусить."
    hide artem with dissolve

    'Я прошел по коридору сначала в ванную, а после на кухню, где обнаружил записку на столе, написанную почерком мамы: "Доброе утро, еда в холодильнике. Удачной учебы <3".'
    "Будет грустно видеть ее лицо после звонка из школы. Закончив прием пищи, я отправился обратно к себе."

    "Осенний ветер колышет ветки за окном, листья, медленно кружась, падают на подоконник, а лучи солнца изо всех сил стараются проникнуть через тонкие шторы в эту невеселую комнату."
    "Это заворожило меня, я даже подумал, что еще могу улавливать что то прекрасное в таких мелочах."

    show artem at left with dissolve
    a "Будь я музыкантом или художником,именно сейчас меня должно было посетить вдохновение для создания чего-то великого. Однако я не Вивальди и не Левитан."
    "Я могу лишь просто наслаждаться этой красотой, чтобы хоть как-то скрасить серость обыденных дней."

    hide artem with dissolve

    "Доделав остаток утренних процедур, я, как обычно, не знал чем заняться дальше. В любой другой день я бы просто открыл стим и запустил одну из игр, просидевших в ней до ночи. Но в этот раз даже играть не хотелось."
    "Я завязал волосы в хвост и лег на уже заправленную постель. Никогда не любил так делать, ведь ты остаешься наедине со своими мыслями. Один на один."

    "Я даже не помню когда именно это началось. Год назад? Два? Когда я потерял всяческий интерес ко всему, что я делаю? И ведь пробовал снова найти то, что будет затягивать с головой, и не раз."
    "Сейчас уже поздно искать себя, попробовать что-то новое, бросать, а затем браться за другое. Одиннадцатый класс, экзамены, выбор вуза. Почему я не ушел после девятого... "

    'Я не хочу прожить жизнь так ничего и не сделав, пока я только потребляю, то что создали другие. Бесит. Мне нужно нечто большее от жизни, но как найти это "большее"?'
    "Я всегда терял искру интереса в том, чем увлекался. Это какой-то барьер, который я не могу преодолеть в силу недостатка мотивации или чего-то еще..."

    show artem at left with dissolve

    a "Мне определенно нужен какой то толчок."

    hide artem with dissolve

    "Я встал с кровати, сел за компьютер и включил рандомную шугейз-группу. Было здорово, когда мы собирались с друзьями и играли что-то подобное."
    "Помню как вчера: приносил заготовки к песне, парни ее разучивали, и мы с наслаждением играли, чувствуя каждую нотку и качаясь в ритм барабанов."
    "Сейчас мы не поддерживаем общение: один переехал, другой бросил музыку ради учебы. Остался только Саня, с которым мы иногда играем что-то на гитарах, но это уже совсем не то, что было раньше."

    "Я до сих пор иногда пишу мелодии, правда уже на синтезаторе. Однако, то что я делаю не звучит как серьезная музыка, которую играют в филармониях. На хит городских дискотек тоже не тянет."
    "Мои наработки похожи на легкие саундтреки к игре, однако, меня это ни капли не расстраивает."

    "Мысли в голове путаются, руки и ноги тяжелеют, в глазах начинает темнеть, кажется я совсем сегодня не выспался."

    "Проснувшись в полной темноте, я еще долго не решался взглянуть на время. Просто тупил в пустоту, не имея ни одной мысли в голове. Просидев так минут десять, я включил монитор. 23:11."
    "Мать видимо решила, что я устал после учебы и не стала беспокоить. Оно и к лучшему."
    "Открыв личные сообщения, я увидел, что мне написал Никита, хотя лучше сказать настрочил. Сколько помню нашу дружбу, он всегда был непоседлив и нетерпелив. Моя полная противоположность. Наверное, от этого мы так и сдружились с ним. "
    "В сообщениях он рассказал о том, что было в школе, скинул домашку и конспекты, а также отправил ссылку на какую-то статью, с подписью: “ты обязательно должен прочитать это”."
    "Планов у меня на сегодняшние ночные посиделки не было, поэтому отписавшись Никите, я пошел смотреть, что же такого он мне кинул."
    show artem at left
    a "Так и знал!"
    hide artem
    "Никита был очень вовлечен в эту сферу и постоянно скидывал мне интересные и не очень статьи об этом, но никогда не прикреплял такие подписи к этим ссылкам."
    "Скорее просто делился тем, чем увлекается, как и положено хорошим друзьям. Это была статья про геймдев, а конкретно про какую-то маленькую инди-студию, которая в этом году всех удивила своими проектами."
    "В одну из тех игр мне удалось поиграть и самому. Не сказать, что она была шедевром, но учитывая их бюджет и количество людей, вышло и правда хорошо. "
    "Прочитав все от начала и до конца, даже я был немного вдохновлен. Не представляю, что сейчас чувствовал впечатлительный Никита. Отписавшись, о том, что я прочитал все, мне сразу поступает звонок в дискорде."
    "Это был кудрявый. Только приняв его, на меня свалился невероятный словесный понос, я с трудом разбирал слова, которые выстреливал из себя этот идиот."

    show artem at left with dissolve
    show nikita at right with dissolve

    a "Так, эминем еврейских кровей, ты можешь немного помедленнее?"
    n "НЕТ"
    a "Успокоишься, позвонишь"
    n "Пойдем прогуляемся?"
    hide nikita
    with dissolve

    menu:
        a "Я уже давно никуда не выходил, и это не казалось такой плохой идеей, однако моя лень и нежелание, что-либо делать магическим образом никуда не исчезали."
        "Остаться дома":
            jump sit_at_home
        "Выйти на улицу":
            jump go_outside

    label sit_at_home:
        "Мои отрицательные стороны и качества оказались сильнее, ничего нового."
        show nikita at right with dissolve
        a "Давай не сегодня, дружище, в школе расскажешь, то что хочешь"
        n "Ты как всегда"
        a "Добрых снов"
        n "Спокойной ночи"
        hide nikita with dissolve
        hide artem with dissolve

        "Я не знаю, что на меня опять нашло. Он же мой друг и явно хотел поделиться чем-то ценным для него. Как будто я отстраняюсь от людей, потому что завидую их стремлениям и желаниям"
        "А может это и к лучшему, хотя-бы меньше поводов для беспокойства и самокопаний. С такими мыслями. Просидев до 4 ночи, меня окончательно начало клонить в сон."
        show artem at left with dissolve
        a "Ну хоть режим на место встанет"
        hide artem with dissolve
        "И вот я уже окончательно погрузился в свой трехчасовой отдых перед учебой."
        jump good_continue

    label go_outside:
        $stay_home = False
        "Мне явно нужно немного подышать свежим воздухом."
        show nikita at right with dissolve
        a "На площадке в 0: 20, не опаздывай. Убью"
        n "Уже одеваюсь!"
        hide nikita with dissolve
        hide artem with dissolve
        "Прокравшись на цыпочках до прихожей, я накинул куртку и выбежал во двор. "
        show artem at left with dissolve
        a "Все-таки, хорошо, что мы живем в домах напротив"
        "На качели уже стоял Никита с улыбкой на все лицо. Я не мог не улыбнуться в ответ. Существует только один человек, который улыбается также ярко и во все зубы как он…"
        show nikita at right with dissolve
        n "Ты точно все прочел?"
        a "Абсолютно"
        n "НУ И? Ничего не почувствовал?"
        a "Красивая история, но к сожалению лишь сплошная удача"
        n "Да это же просто нечто, их было всего четверо, а они смогли так много сделать имея так мало."
        a "Только не говори мне, что…"
        n "Мы будем делать игру!"
        a "Черт"
        "Ну как же так. Без объявления войны. Вот так просто. Он всегда был таким, подначивал на всяческие авантюры с поводом и без, а я отнекиваюсь."
        "Хотя по итогу все равно соглашаюсь… Возможно только из-за него я окончательно не превратился в амёбу."
        a "Так ладно. У тебя хоть идеи есть?"
        n "Ты даже не станешь спорить? Тебя машина недавно не сбивала? Где Артем, признавайся!"
        a "Улетел на другой край света. Подальше от надоедливого придурка."
        n "Ну есть парочка, но нам нужна команда. Как минимум еще 2 человека – сценарист и художник"
        a "Вот и ищи, на меня не надейся."
        n "Ну, пожалуйста!"
        a "..."
        "Никита попытался состроить гримасу кота в сапогах из “шрека”."
        a "Ты в курсе, что являешься той еще занозой?"
        n "Угу"
        "Мы поговорили еще пару минут о разных мелочах, я почувствовал, что начинаю замерзать. Посмотрев на осеннее небо, а потом на Никиту. Мне почему-то взбрело сказать это."
        a "Я что-нибудь придумаю, а теперь давай по домам."
        n "Ура! До встречи!"
        a "Ага"
        hide artem with dissolve
        hide nikita with dissolve
        "Придя домой, я еще долго не мог уснуть. Неужели меня и правда вдохновила вся эта история с маленькой студией или же дело в чем-то другом."
        "Точно не могу ответить на этот вопрос, по крайней мере сейчас. Кажется становится не так скучно…"
        jump bad_continue

        label good_continue:
            "Хороший конец"

        label bad_continue:
            "Плохой конец"

    return
